#+TITLE: TimeData.jl
#+OPTIONS: eval:never-export
#+PROPERTY: exports both
#+PROPERTY: results value
#+PROPERTY: session *julia-docs*
#+OPTIONS: tangle:test/doctests.jl
#+OPTIONS: author:nil
#+OPTIONS: title:nil
#+OPTIONS: email:nil
#+OPTIONS: timestamp:nil
#+OPTIONS: toc:yes
#+OPTIONS: html-doctype:html5

#+HTML_HEAD: <meta charset='utf-8'>
#+HTML_HEAD: <meta http-equiv="X-UA-Compatible" content="chrome=1">
#+HTML_HEAD: <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
#+HTML_HEAD: <link href='https://fonts.googleapis.com/css?family=Architects+Daughter' rel='stylesheet' type='text/css'>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="stylesheets/stylesheet.css" media="screen" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="stylesheets/pygment_trac.css" media="screen" />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="stylesheets/print.css" media="print" />

#+HTML_HEAD_EXTRA: <header>
#+HTML_HEAD_EXTRA:  <div class="inner">
#+HTML_HEAD_EXTRA:         <h1>TimeData.jl</h1>
#+HTML_HEAD_EXTRA:         <h2>TimeData package for Julia language</h2>
#+HTML_HEAD_EXTRA:         <a href="https://github.com/cgroll/TimeData.jl" class="button"><small>View project on</small>GitHub</a>
#+HTML_HEAD_EXTRA:       </div>
#+HTML_HEAD_EXTRA:     </header>


#+HTML_HEAD_EXTRA:     <div id="content-wrapper">
#+HTML_HEAD_EXTRA:       <div class="inner clearfix">
#+HTML_HEAD_EXTRA: <aside id="sidebar">
#+HTML_HEAD_EXTRA:    <a href="https://github.com/cgroll/TimeData.jl/zipball/master" class="button">
#+HTML_HEAD_EXTRA:      <small>Download</small>
#+HTML_HEAD_EXTRA:      .zip file
#+HTML_HEAD_EXTRA:    </a>
#+HTML_HEAD_EXTRA:    <a href="https://github.com/cgroll/TimeData.jl/tarball/master" class="button">
#+HTML_HEAD_EXTRA:      <small>Download</small>
#+HTML_HEAD_EXTRA:      .tar.gz file
#+HTML_HEAD_EXTRA:    </a>
#+HTML_HEAD_EXTRA:     <p class="repo-owner"><a href="https://github.com/cgroll/TimeData.jl"></a> maintained by <a href="https://github.com/cgroll">cgroll</a>.</p>
#+HTML_HEAD_EXTRA:  </aside>

#+HTML_HEAD_EXTRA:         <section id="main-content">
#+HTML_HEAD_EXTRA:           <div>


#+BEGIN_COMMENT
The only post-processing that needs to be done is removing the h1
title in the html. This is the second time that the word title occurs. 
#+END_COMMENT

#+BEGIN_SRC julia :exports none :results output :tangle test/doctests.jl
module TestDocumentation

using Base.Test
using DataArrays
using DataFrames

println("\n Running documentation tests\n")

#+END_SRC


* TimeData types

All types introduced are subtypes of abstract type ~AbstractTimedata~
and have two fields, separating time information from observations:
- *vals:* a ~DataFrame~ 
- *idx:* an ~Array{T, 1}~, consisting of either type
  - ~Integer~,
  - ~Date~, or
  - ~DateTime~ (from package ~Datetime~)
         
However, accessing these fields directly is considered poor style, as
one could circumvent any constraints on the individual fields this
way! Hence, only reference the fields directly if you really know what
you are doing.

Given these commonalities of all ~TimeData~ types, there exist several
distinct types that implement different constraints on the
observations. Sorted from most general to most specific case, the
following types are introduced:
- ~Timedata~: no further restrictions on observations
- ~Timenum~: observations may consist of numeric values or missing
               values only
- ~Timematr~: observations must be numeric values only
- ~Timecop~: observations must be numeric values between 0 and 1
               only

Given that these constraints are fulfilled, one is able to define and
use more specific functions matching the data characteristics more
closely. For example, ~Timematr~ instances can directly make use of
fast and numerically optimized methods using ~Array{Float64, 2}~ under
the hood. Hence, it is important that these constraints are reliably
fulfilled. They are guaranteed as they are hard-coded into variables
at time of creation through the individual constructors. And, by now,
no further ~setindex~ methods exist that would allow data
manipulation.

* Constructors

For each type, variables can be created by directly handing over
observations as ~DataFrame~ and time information as ~Array~ to the
inner constructor.
#+BEGIN_SRC julia :results output :tangle test/doctests.jl
   using TimeData
   using Datetime

   vals = rand(4, 3);
   dats = Date{ISOCalendar}[date(2013, 7, ii) for ii=1:4];
   nams = [:A, :B, :C];
   valsDf = composeDataFrame(vals, nams);
   
   tm = Timematr(valsDf, dats)
#+END_SRC

#+RESULTS:
#+begin_example









type: Timematr{Date{ISOCalendar}}
dimensions: (4,3)
4x4 DataFrame
|-------|------------|-----------|----------|----------|
| Row # | idx        | A         | B        | C        |
| 1     | 2013-07-01 | 0.748284  | 0.650792 | 0.10363  |
| 2     | 2013-07-02 | 0.118111  | 0.954352 | 0.63716  |
| 3     | 2013-07-03 | 0.669835  | 0.351356 | 0.894607 |
| 4     | 2013-07-04 | 0.0447977 | 0.34037  | 0.399474 |
#+end_example

Besides, there also exist several outer constructors for each type,
allowing more convenient creation. In particular, if observations do
not entail any ~NAs~, there is no need to wrap them up into
~DataFrames~ previously, but ~TimeData~ objects can simply be created
from ~Arrays~. Also, there might be situations where variable names
and / or dates are missing. For these cases, there exist more
convenient outer constructors, too, which generally follow the
convention that dates never precede variable names as arguments.

#+BEGIN_SRC julia :results output :tangle test/doctests.jl
   td = Timedata(vals, nams, dats)
   td = Timedata(vals, nams)
   td = Timedata(vals, dats)
   td = Timedata(vals)
#+END_SRC

#+RESULTS:
#+begin_example

type: Timedata{Date{ISOCalendar}}
dimensions: (4,3)
4x4 DataFrame
|-------|------------|-----------|----------|----------|
| Row # | idx        | A         | B        | C        |
| 1     | 2013-07-01 | 0.748284  | 0.650792 | 0.10363  |
| 2     | 2013-07-02 | 0.118111  | 0.954352 | 0.63716  |
| 3     | 2013-07-03 | 0.669835  | 0.351356 | 0.894607 |
| 4     | 2013-07-04 | 0.0447977 | 0.34037  | 0.399474 |

type: Timedata{Int64}
dimensions: (4,3)
4x4 DataFrame
|-------|-----|-----------|----------|----------|
| Row # | idx | A         | B        | C        |
| 1     | 1   | 0.748284  | 0.650792 | 0.10363  |
| 2     | 2   | 0.118111  | 0.954352 | 0.63716  |
| 3     | 3   | 0.669835  | 0.351356 | 0.894607 |
| 4     | 4   | 0.0447977 | 0.34037  | 0.399474 |

type: Timedata{Date{ISOCalendar}}
dimensions: (4,3)
4x4 DataFrame
|-------|------------|-----------|----------|----------|
| Row # | idx        | x1        | x2       | x3       |
| 1     | 2013-07-01 | 0.748284  | 0.650792 | 0.10363  |
| 2     | 2013-07-02 | 0.118111  | 0.954352 | 0.63716  |
| 3     | 2013-07-03 | 0.669835  | 0.351356 | 0.894607 |
| 4     | 2013-07-04 | 0.0447977 | 0.34037  | 0.399474 |

type: Timedata{Int64}
dimensions: (4,3)
4x4 DataFrame
|-------|-----|-----------|----------|----------|
| Row # | idx | x1        | x2       | x3       |
| 1     | 1   | 0.748284  | 0.650792 | 0.10363  |
| 2     | 2   | 0.118111  | 0.954352 | 0.63716  |
| 3     | 3   | 0.669835  | 0.351356 | 0.894607 |
| 4     | 4   | 0.0447977 | 0.34037  | 0.399474 |
#+end_example

* Indexing

The idea of ~getindex~ is to stick with the behavior of ~DataFrames~
as far as possible for the basics, while extending it to allow
indexing of rows by dates. Hence, indexing ~TimeData~ types should
hopefully fit seamlessly into behavior familiar from other important
types, with only intuitive extensions. However, it is important to
note that indexing deviates from ~DataFrame~ behavior in one aspect:
~getindex~ will NEVER change the type of the variable! If you call it
on a ~Timematr~ variable, it will also return a ~Timematr~ variable,
and if you call it on type ~Timenum~ it will return ~Timenum~ as well.
This behavior does deviate from ~DataFrame~ behavior in such that, for
example, ~DataFrames~ return ~Array~ for single columns.

#+BEGIN_SRC julia :tangle test/doctests.jl :exports both :results output
   typeof(valsDf[:, 1])
   typeof(td[:, 1])
   
   typeof(valsDf[1, 1])
   typeof(td[1, 1])
   
   ## empty instance
   typeof(td[4:3, 5:4])
      
#+END_SRC

This will print:
#+RESULTS:
: Array{Float64,1}
: Timedata{Int64} (constructor with 1 method)
: 
: Float64
: Timedata{Int64} (constructor with 1 method)
: 
: 
: Timedata{Int64} (constructor with 1 method)


Possible ways of indexing are:
#+BEGIN_SRC julia :tangle test/doctests.jl :results silent
   ## indexing by numeric indices
   tmp = tm[2:3]
   tmp = tm[1:3, 1:2]
   tmp = tm[2, :]
   tmp = tm[2]
   tmp = tm[1:2, 2]
   tmp = tm[3, 3]
   
   ## indexing with column names as symbols
   tmp = tm[:A]
   tmp = tm[2, [:A, :B]]
   
   ## logical indexing
   logicCol = [true, false, true]
   logicRow = repmat([true, false], 2, 1)[:]
   tmp = tm[logicCol]
   tmp = tm[logicRow, logicCol]
   tmp = tm[logicRow, :]
   
   ## indexing with dates
   datesToFind = Date{ISOCalendar}[date(2013, 7, ii) for ii=2:3]
   tmp = tm[datesToFind]
   tm[date(2013,7,1):date(2013,7,3)]
   tm[date(2013,7,2):date(2013,7,3), :B]
   tm[date(2013,7,3):date(2013,7,12), [true, false, false]]
#+END_SRC


* Read, write, io

Data can easily be imported from csv-files using function
~readTimedata~. Under the hood, the function makes use of ~readtable~
from the ~DataFrames~ package. Additionally, columns are parsed for
dates. The first column matching the regexp for dates will be chosen
as time identifier.
#+BEGIN_SRC julia :tangle test/doctests.jl :results output
   filePath = joinpath(Pkg.dir("TimeData"), "data", "logRet.csv");
   tm = readTimedata(filePath)
#+END_SRC

After loading the data, Julia will call the standard ~display~ method
to show information about the data:

#+RESULTS:
#+begin_example


type: Timematr{Date{ISOCalendar}}
dimensions: (333,348)
333x6 DataFrame
|-------|------------|----------|----------|----------|----------|----------|
| Row # | idx        | MMM      | ABT      | ACE      | ACT      | ADBE     |
| 1     | 2012-01-03 | 2.12505  | 0.88718  | 0.29744  | 0.47946  | 1.0556   |
| 2     | 2012-01-04 | 0.82264  | -0.38476 | -0.95495 | -0.52919 | -1.02024 |
| 3     | 2012-01-05 | -0.44787 | -0.23157 | 0.28445  | 2.74752  | 0.70472  |
| 4     | 2012-01-06 | -0.51253 | -0.93168 | 0.23891  | 1.94894  | 0.83917  |
| 5     | 2012-01-09 | 0.58732  | 0.0      | 0.46128  | 0.28436  | -0.66376 |
| 6     | 2012-01-10 | 0.52193  | 0.46693  | 1.31261  | 1.85986  | 2.32125  |
| 7     | 2012-01-11 | -0.63413 | -0.38895 | -1.52066 | -3.06604 | 0.41012  |
| 8     | 2012-01-12 | 0.60934  | -0.46875 | 0.50453  | -0.93039 | -0.30743 |
⋮
| 325   | 2013-04-19 | 0.69118  | 0.86745  | 0.77089  | 1.84469  | 0.6278   |
| 326   | 2013-04-22 | 0.08606  | -0.84023 | 0.27067  | -0.64178 | -0.47048 |
| 327   | 2013-04-23 | 1.48952  | 0.86721  | 0.8188   | 0.93582  | 0.76063  |
| 328   | 2013-04-24 | 0.451    | -1.8794  | -0.51518 | -0.49734 | -0.44673 |
| 329   | 2013-04-25 | -2.81414 | -0.08252 | -0.04492 | 0.61876  | 0.84708  |
| 330   | 2013-04-26 | -1.04683 | -0.08259 | -0.63106 | 2.05182  | -0.31125 |
| 331   | 2013-04-29 | 0.03897  | 0.74085  | -0.02261 | 4.49427  | 0.33344  |
| 332   | 2013-04-30 | 0.84381  | 0.51807  | 0.24845  | 0.14197  | 0.04438  |
| 333   | 2013-05-01 | -0.14498 | -0.08162 | -0.94057 | -1.27548 | -0.82415 |
#+end_example

As one can see, the ~display~ method will show the type of the
variable, together with its dimensions and a snippet of the first
values. Note that the number of columns does not entail the dates
column, but does only count the columns of the remaining variables.
Inherently, ~display~ makes use of the display method that is
implemented for ~DataFrames~, which is the reason for the somewhat
misleading output line ~333x6 DataFrame:~. An issue that still needs
to be fixed. However, html display in IJulia already shows an improved
table output.

An even more elaborate way of looking at the data contained in a
~TimeData~ type is function ~str~ (following the name used in R),
which will print:

#+BEGIN_SRC julia :tangle test/doctests.jl :results output
#   str(tm) # uncomment for execution
#+END_SRC

#+RESULTS:
#+begin_example

type: Timematr{Date{ISOCalendar}}
:vals  		  DataFrame
:idx  		  Array{Date{ISOCalendar},1}

dimensions of vals: (333,348)

-------------------------------------------
From: 2012-01-03, To: 2013-05-01
-------------------------------------------

333x6 DataFrame
|-------|------------|----------|----------|----------|----------|----------|
| Row # | idx        | MMM      | ABT      | ACE      | ACT      | ADBE     |
| 1     | 2012-01-03 | 2.12505  | 0.88718  | 0.29744  | 0.47946  | 1.0556   |
| 2     | 2012-01-04 | 0.82264  | -0.38476 | -0.95495 | -0.52919 | -1.02024 |
| 3     | 2012-01-05 | -0.44787 | -0.23157 | 0.28445  | 2.74752  | 0.70472  |
| 4     | 2012-01-06 | -0.51253 | -0.93168 | 0.23891  | 1.94894  | 0.83917  |
| 5     | 2012-01-09 | 0.58732  | 0.0      | 0.46128  | 0.28436  | -0.66376 |
| 6     | 2012-01-10 | 0.52193  | 0.46693  | 1.31261  | 1.85986  | 2.32125  |
| 7     | 2012-01-11 | -0.63413 | -0.38895 | -1.52066 | -3.06604 | 0.41012  |
| 8     | 2012-01-12 | 0.60934  | -0.46875 | 0.50453  | -0.93039 | -0.30743 |
⋮
| 325   | 2013-04-19 | 0.69118  | 0.86745  | 0.77089  | 1.84469  | 0.6278   |
| 326   | 2013-04-22 | 0.08606  | -0.84023 | 0.27067  | -0.64178 | -0.47048 |
| 327   | 2013-04-23 | 1.48952  | 0.86721  | 0.8188   | 0.93582  | 0.76063  |
| 328   | 2013-04-24 | 0.451    | -1.8794  | -0.51518 | -0.49734 | -0.44673 |
| 329   | 2013-04-25 | -2.81414 | -0.08252 | -0.04492 | 0.61876  | 0.84708  |
| 330   | 2013-04-26 | -1.04683 | -0.08259 | -0.63106 | 2.05182  | -0.31125 |
| 331   | 2013-04-29 | 0.03897  | 0.74085  | -0.02261 | 4.49427  | 0.33344  |
| 332   | 2013-04-30 | 0.84381  | 0.51807  | 0.24845  | 0.14197  | 0.04438  |
| 333   | 2013-05-01 | -0.14498 | -0.08162 | -0.94057 | -1.27548 | -0.82415 |
#+end_example

This additionally shows the names of the fields of the object, and
also explicitly displays the time period of the data.

To save an object to disk, simply call function ~writeTimedata~, which
internally uses ~writetable~ from the ~DataFrame~ package. In
accordance with ~writetable~, the first argument is the filename as
string, while the second argument is the variable to be saved.

#+BEGIN_SRC julia :tangle test/doctests.jl :results silent
#   writeTimedata("data/logRet2.csv", tm) # uncomment for execution
#+END_SRC

* Functions and operators

Mathematical operators and functions are only implemented on for
Timematr types, since they are not well defined operations for general
data (strings, ...).

Whenever possible, functions apply elementwise to observations only,
and you should get back the same type that you did call the function
on. In case that this is not possible, the type that you get back
should be the natural first choice. For example, elementwise
comparisons should return a logical value for each entry, which by
definition could not be of type ~Timenum~ where only numeric values
are allowed.

#+BEGIN_SRC julia :results output :tangle test/doctests.jl
   typeof(tm .+ tm)
   typeof(tm .> 0.5)
#+END_SRC

#+RESULTS:
: Timematr{Date{ISOCalendar}} (constructor with 1 method)
: Timedata{Date{ISOCalendar}} (constructor with 1 method)

The standard library for ~TimeData~ comprises all standard operators
and mathematical functions. As expected, these functions all apply
elementwise, and leave the time information untouched. Where
additional arguments are allowed for ~Arrays~, they are allowed for
~TimeData~ types as well.

#+BEGIN_SRC julia :results output :tangle test/doctests.jl
   tm[1:3, 1:3] .> 0.5
   exp(tm[1:3, 1:3])
   round(tm[1:3, 1:3], 2)
#+END_SRC

#+RESULTS:
#+begin_example

type: Timedata{Date{ISOCalendar}}
dimensions: (3,3)
3x4 DataFrame
|-------|------------|-------|-------|-------|
| Row # | idx        | MMM   | ABT   | ACE   |
| 1     | 2012-01-03 | true  | true  | false |
| 2     | 2012-01-04 | true  | false | false |
| 3     | 2012-01-05 | false | false | false |

type: Timematr{Date{ISOCalendar}}
dimensions: (3,3)
3x4 DataFrame
|-------|------------|----------|----------|----------|
| Row # | idx        | MMM      | ABT      | ACE      |
| 1     | 2012-01-03 | 8.37332  | 2.42827  | 1.34641  |
| 2     | 2012-01-04 | 2.2765   | 0.680614 | 0.384831 |
| 3     | 2012-01-05 | 0.638988 | 0.793287 | 1.32903  |

type: Timematr{Date{ISOCalendar}}
dimensions: (3,3)
3x4 DataFrame
|-------|------------|-------|-------|-------|
| Row # | idx        | MMM   | ABT   | ACE   |
| 1     | 2012-01-03 | 2.13  | 0.89  | 0.3   |
| 2     | 2012-01-04 | 0.82  | -0.38 | -0.95 |
| 3     | 2012-01-05 | -0.45 | -0.23 | 0.28  |
#+end_example

A most likely not exhaustive list of basic functions is
#+BEGIN_SRC julia :tangle no :eval never
   TimeDataFunctions = [:(.+), :(.-), :(.*), :(./), :(.^),
                        :(.==), :(.!=), :(.>), :(.>=), :(.<), :(.<=),
                        :(&), :(|), :($),
                        :(div), :(mod), :(fld), :(rem),
                        :abs, :sign, :acos, :acosh, :asin, :asinh, :atan,
                        :atanh, :sin, :sinh, :cos, :cosh, :tan, :tanh,
                        :exp, :exp2, :expm1, :log, :log10, :log1p, :log2,
                        :exponent, :sqrt, :gamma, :lgamma, :digamma,
                        :erf, :erfc,
                        :round, :ceil, :floor, :trunc]
#+END_SRC


* Additional functions
Besides basic mathematical functions and operators, there are some
additional functions that are defined for each ~TimeData~ type. For
example, you can retrieve individual components of your variable with
the following functions:
- ~idx~: returns time information as ~Array~
- ~names~: returns variable names as
  ~Array{Union(UTF8String,ASCIIString),1}~  
- ~core~: implemented for subtypes of ~AbstractTimematr~, it returns a
  matrix of numeric values
These functions shall help to inhibit direct access of ~TimeData~
fields, which should be avoided.

Some further implemented functions are: 
- ~isequal~ 
- ~size~
- ~isna~

Furthermore, subtypes of type ~AbstractTimematr~ should already
provide functionality for basic statistical functions like ~mean~,
~var~ and ~cov~.

* Acknowledgement

Of course, any package can only be as good as the individual parts
that it builds on. Accordingly, I'd like to thank all people that
were involved in the development of all the functions that were made
ready to use for me to build this package upon. In particular, I want
to thank the developers of
- the *Julia language*, for their continuous and tremendous efforts
  during the creation of this free, fast and highly flexible
  programming language!
- the *DataFrames* package, which definitely provides the best
  representation for general types of data in data analysis. It's a
  role model that every last bit of code of ~TimeData~ depends on, and
  the interface that every statistics package should use.
- the *Datetime* package, which is a thoughtful implementation of
  dates, time and durations, and the backbone of all time components
  in ~TimeData~.
- the *TimeSeries* package, which follows a different approach to
  handling time series data. Having a quite similar goal in mind, the
  package was a great inspiration for me, and occasionally I even
  could borrow parts of code from it (for example, from an old version
  of function ~readtime~).

#+BEGIN_SRC julia :exports none :results output :tangle test/doctests.jl
end
#+END_SRC
